app/controllers/assignments_controller.rb

  def index
    @assignments = Assignment.all
---
SELECT "assignments".* FROM "assignments"

  def create
    @assignment = Assignment.new(assignment_params)
    @assignment.assign

    respond_to do |format|
      if @assignment.save
---
INSERT INTO "assignments" ("name", "due", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "assignment"], ["due", "2015-06-10"], ["created_at", "2015-06-19 17:32:08.104356"], ["updated_at", "2015-06-19 17:32:08.104356"]]

  def destroy
    @assignment.destroy
---
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 980190962]]

    def set_assignment
      @assignment = Assignment.find(params[:id])
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 980190962]]