app/controllers/dashboard_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 980190962]]
SELECT "grades".* FROM "grades" WHERE "grades"."student_id" = ?  [["student_id", 980190962]]
---
  def student
    @student = Student.find_by_id(session[:user_id])
    @grades = Grade.where(student_id: session[:user_id]).all

SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 980190962]]
SELECT "grades".* FROM "grades" WHERE "grades"."student_id" = ?  [["student_id", 980190962]]
---
  def parent
    @parent = Parent.find_by_id(session[:user_id])
    @grades = Grade.where(student_id: @parent.student_id).all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def teacher
    @teacher = Teacher.find_by_id(session[:user_id])