app/controllers/grades_controller.rb

SELECT "grades".* FROM "grades"
---
  def index
    @grades = Grade.all

SELECT "assignments".* FROM "assignments"
---
  def new
    @grade = Grade.new(student_id: params[:student_id])
    @assignments = Assignment.all

INSERT INTO "grades" ("assignment_id", "score", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["assignment_id", 980190962], ["score", 1], ["student_id", 980190962], ["created_at", "2015-06-19 17:32:08.158480"], ["updated_at", "2015-06-19 17:32:08.158480"]]
---
  def create
    @grade = Grade.new(grade_params)

    respond_to do |format|
      if @grade.save

DELETE FROM "grades" WHERE "grades"."id" = ?  [["id", 980190962]]
---
  def destroy
    @grade.destroy

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_grade
      @grade = Grade.find(params[:id])