app/controllers/parents_controller.rb

SELECT "parents".* FROM "parents"
---
  def index
    @parents = Parent.all

INSERT INTO "parents" ("name", "email", "password_digest", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @parent = Parent.new(parent_params)

    respond_to do |format|
      if @parent.save

DELETE FROM "parents" WHERE "parents"."id" = ?  [["id", 980190962]]
SELECT  "parents".* FROM "parents" WHERE "parents"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def destroy
    @parent.destroy
    respond_to do |format|
      format.html { redirect_to parents_url, notice: 'Parent was successfully destroyed.' }
      format.json { head :no_content }
    end
  end


  private def set_parent
    @parent = Parent.find(params[:id])