app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save